Repository: NeuralNinjas-AI/AirQuality
Catalog: Datasets/archive/ELRC_417_Parallel texts from Swedish Work environment/ELRC_417_Parallel texts from Swedish Work environment [...]_dataset/261.en-sv.tmx
Source language: en
Languages: sv

source: Adjustments for persons with hearing impairment include adequately short reverberation times in workrooms and personnel facilities, a low background noise level, flooring to minimise the occurrence of annoying sounds, and the installation of audio loops in classrooms and conference rooms, etc.
sv: Exempel på anpassning för hörselskadade är tillräckligt korta efter- klangstider i arbetslokaler och personalutrymmen, låg nivå på bakgrundsbuller, golvbeläggning och möbler som minimerar uppkomsten av störande ljud samt installation av hörselslinga i rum för undervisning, sammanträden o.dyl.

source: Examples of measures for persons with allergy problems are choosing easily cleaned furnishings, low-emission materials, continuous ventilation and increased cleaning.
sv: Exempel på åtgärder för allergiker är att välja lättstädad inredning, lå- gemitterande material, kontinuerlig ventilation och utökad städning.

source: The accessibility and design of facilities are among the factors influencing the ability of employees to remain in or return to working life and are thus an important part of the employer’s task of adapting working conditions to the work capacity and functional impairment of individuals.
sv: Lokalernas tillgänglighet och utformning tillhör de faktorer som är av vikt både för arbetstagares möjlighet att vara kvar i eller återkomma till arbetslivet, och för arbetsgivarens uppgift att anpassa arbetsförhållandena till enskildas arbetsförmåga och funktionsnedsättning.

source: Job modification and rehabilitation aspects therefore need to be taken into account already at the project planning stage.
sv: Arbetsanpassnings- och rehabiliteringsaspekter behöver därför beaktas redan vid lokalplane- ringen i projekteringsstadiet.

source: See the provisions of the National Board of Occupational Safety and Health on job adaptation and rehabilitation.
sv: Se Arbetarskyddsstyrelsens föreskrifter om arbetsanpassning och rehabilitering.

source: The design of buildings in relation to accessibility and usability for persons with functional impairments is also regulated by the Planning and Building Act (PBL), the Construction Act (BVL) and its Ordinance (BVF)
sv: Byggnaders utformning med avseende på tillgänglighet och användbarhet för personer med funktionsnedsättning regleras även av plan- och bygglagen (PBL), byggnadsverkslagen (BVL) och dess förordning (BVF).

source: The Building Regulations (BBR) of the National Board of Housing, Building and Planning apply to new buildings and extensions, and the provisions and general recommendations issued by the National Board of Housing, Building and Planning on the removal of easily eliminated obstacles (HIN) apply to premises to which the public has access and in public spaces.
sv: Boverkets byggregler BBR om tillgänglighet gäller vid nybyggnad och tillbyggnad och Boverkets föreskrifter och allmänna råd om enkelt avhjälpta hinder (HIN) gäller för befintliga lokaler dit allmänheten har tillträde och allmänna platser.

source: The provisions and general advice issued by the National Board of Housing, Building and Planning on accessibility and usability for people with limited mobility or orientation capacity in public spaces and in areas for constructions other than buildings (ALM) apply to new construction in these public places and areas that can also constitute workplaces.
sv: Boverkets föreskrifter och allmänna råd om tillgänglighet och användbarhet för personer med nedsatt rörelse- eller orienteringsför- måga på allmänna platser och inom områden för andra anläggningar än byggnader (ALM) gäller för nyanläggning av dessa allmänna platser och områden som även kan utgöra arbetsplatser.

source: Examples of these are leisure areas, amusement parks, golf courses and ski slopes with lifts.
sv: Det kan t.ex. vara fritidsområden, nöjesparker, golfbanor och skidbackar med liftar.

source: According to the Discrimination Act, employers are liable to ensure that a job applicant or work experience trainee with functional impairment will be in an equivalent position as a person without functional impairment.
sv: Enligt diskrimineringslagen är en arbetsgivare skyldig att se till att en arbetssökande eller en yrkespraktikant med funktionsnedsättning kommer i jämförbar situation med en person utan funktionsnedsättning.

source: In the selection of flooring materials, slip-resistance and convenient cleaning may sometimes appear to be contradictory requirements.
sv: Vid val av golvmaterial kan strävan efter halkfrihet och lätthet att städa ibland upplevas som motstridiga krav.

source: On food premises, for example, spillage of water and fatty substances calls for a slip- resistant floor, while on the other hand food hygiene demands careful cleaning.
sv: I t.ex. livsmedelslokaler förekommer spill av vatten och fett så att halkrisken kräver ytsträvt golv, samtidigt som livsmedelshygienen kräver att golven ska kunna rengöras noggrant.

source: There are, however, cleaning methods, even for rough flooring, which satisfy the requirements of both convenient and highly efficient cleaning.
sv: Det finns dock rengöringsmetoder även för ytsträva golv som tillfredsställer både kravet på lätthet att städa och höga krav på resultatet.

source: It is important that workplaces and social areas outdoors should be designed and managed so as to minimise the risk of slips and falls.
sv: Det är viktigt att arbetsplatser och pausutrymmen utomhus utformas och sköts så att risken för halka och fall minimeras.

source: Where there is a risk of slipping during the winter season, work areas and traffic routes need to be cleared and sanded.
sv: Vid risk för halka under vintersäsongen behöver arbetsområden och förbindelseleder skottas och sandas.

source: Inconveniences which can entail a special risk of ill-health and for which a separate room may therefore be justified include, for example, noise, vibrations, heat, cold, radiation, dust, chip formation, smoke, fog, gas, vapour and noisome or dangerous chemical microbiological agents.
sv: Till 8 § Exempel på olägenheter som kan medföra särskilda risker för ohälsa och därför kan motivera särskild lokal är buller, vibrationer, värme, kyla, strålning, damm, spån, rök, dimma, gas, ånga och illaluktande eller farliga kemiska eller mikrobiologiska agens.

source: In the first instance, nuisances should be avoided by selecting less hazardous substances and processes.
sv: I första hand bör olägenheter undvikas genom val av ämnen och processer som är mindre riskabla.

source: The purpose of segregating a hazardous process is to avert injuries by preventing the nuisance from affecting more people than necessary.
sv: Syftet med att avskilja en riskabel process är att förebygga skador genom att olägenheterna hindras att beröra flera än nödvändigt.

source: In exceptional cases, preventive measures of other kinds may constitute an alternative to segregation.
sv: Andra slags förebyggande åtgärder kan undantagsvis vara alternativ till avskiljning.

source: They may also be needed as a supplementary expedient.
sv: De kan också behövas som kompletterande åtgärder.

source: Measures of this kind include, for example, process ventilation, screening-off, a separate room for personnel or, as a last resort, personal protective equipment.
sv: Exempel på sådana åtgärder är processventilation, avskärmning, avskilt utrymme för personalen eller, i sista hand, personlig skyddsutrustning.

source: Equipment and components which can often be placed in a special room because of noise problems include, for example, fans, pumps, hydraulic units, transformers and compressors.
sv: Exempel på utrustning och komponenter som ofta kan placeras i ett särskilt utrymme på grund av bullerproblem är fläktar, pumpar, hydraulaggregat, transformatorer och kompressorer.

source: Their positioning, however, needs to be planned with regard to the noise exposure of service staff.
sv: Uppställningen behöver dock planeras så att servicepersonalen inte utsätts för onödigt buller.

source: If several units are placed in the same room, it may be appropriate for steps to be taken so that all units in the room can be turned off simultaneously for servicing.
sv: Om flera aggregat placeras i samma utrymme kan det vara lämpligt att se till så att alla aggregat i utrymmet kan stängas av samtidigt vid service.

source: Rules on the design of work premises where flammable and explosive goods are handled are contained in the provisions of the Swedish Rescue Services Agency.
sv: Regler för utformning av arbetslokaler där brandfarliga och explosiva varor hanteras finns i Räddningsverkets föreskrifter.

source: Some older provisions issued by the National Inspectorate of Explosives and Flammables are still in force.
sv: Några äldre föreskrifter från Sprängämnesinspektionen gäller fortfarande.

source: These provisions continue in force under the new Swedish Civil Contingencies Authority.
sv: Dessa föreskrifter fortsätter att gälla i den nya Myndigheten för samhällsskydd och beredskap.

source: Abundant daylight and a generous outdoor view should therefore be aimed for.
sv: Rikligt dagsljus och god utblick bör därför eftersträvas.

source: Every part of the activity which can be carried on in daylight should be placed in a room with windows.
sv: Varje del av verksamheten som kan utföras i dagsljus bör placeras i lokal med fönster.

source: Apart from providing illumination, daylight has an intrinsic value.
sv: Dagsljus har förutom som belysning ett egenvärde.

source: It benefits health by supplying a physiologically necessary stimulus for human circadian and annual rhythms, orientation in time and space and natural perception of the different colours and shapes of the room and objects in it.
sv: Dagsljus är positivt för hälsotillståndet genom att ge fysiologiskt nödvändig stimulans för människans dygns- och årsrytmer, orientering i tid och rum samt naturlig uppfattning av rummets och föremålens skiftningar i färg och form.

source: Access to daylight depends partly on the design, orientation, size and vertical positioning of windows.
sv: Tillgången till dagsljus beror bl.a. av fönstrens utformning, orientering, storlek och placering i höjd.

source: In workrooms with a depth not exceeding 6-8 m, wall windows can most often admit sufficient daylight if their glazed area equals about 10% of the floor space.
sv: För arbetslokal med rumsdjup mindre än 6–8 m kan väggfönster oftast ge tillfredsställande dagsljus om fönsterglasarean uppgår till ca 10 % av golvarean.

source: A larger glazed area may be needed, for example, if the daylight is blocked by other buildings.
sv: Större glasarea kan behövas t.ex. om andra byggnader skärmar av dagsljuset.

source: Secondary light, received through windows from another, directly lit room, can sometimes afford adequate daylight.
sv: Sekundärt ljus, som fås genom fönster från annat, direkt belyst utrymme kan ibland ge godtagbart dagsljus.

source: In certain cases daylight is out of the question owing to the nature of the activity.
sv: I vissa fall kan dagsljus inte komma ifråga på grund av verksamhetens art.

source: Situations where daylight can usually be excluded partly or wholly include, for example: premises for photographic work, mine workshops, power stations below ground, basement storage facilities, servicing premises for underground installations, if the servicing premises necessarily adjoin the installation, freezers and chillers, shopping centres with large floor areas and premises where adequate product quality is only attainable with a small window area, e.g. as a means of maintaining constant air temperature and humidity on the premises.
sv: Exempel på fall då dagsljus helt eller delvis brukar kunna utelämnas är: lokal för fotografiska arbeten, bergverkstad, kraftstation förlagd under jord, lagerlokal i källarvåning, servicelokal för underjordisk anläggning om lokalen måste ligga i anslutning till anläggningen, frys- och kylrum, affärscentra med stor golvyta samt lokal där det för att erhålla en fullgod produkt är nödvändigt att ha en liten fönsteryta, t.ex. för att hålla lufttemperatur och luftfuktighet i lokalen konstanta.

source: Where daylight is lacking in the workrooms, it is especially important that rooms for rest breaks and other intermissions should have windows.
sv: Om dagsljus saknas i arbetslokalerna är det särskilt viktigt att utrymmen för raster och pauser har fönster.

source: In certain cases, access to daylight and an outside view is of minor importance and can be dispensed with.
sv: I vissa fall är tillgång till dagsljus och utblick av mindre betydelse och kan utelämnas.

source: This applies, for example, to such personnel facilities as changing rooms, drying rooms, wash basins and showers and toilets.
sv: Detta gäller exempelvis personalutrymmen som klädrum, omklädningsrum, torkrum, tvätt- och duschrum och toalettrum, utrymmen där man normalt vistas under mycket kort tid.

source: In addition to being a source of daylight, windows provide an opportunity for looking out.
sv: Förutom att vara källa för dagsljus ger fönstren möjlighet till utblick.

source: View windows provide contact with the surrounding, so as to supply information for orientation, experience of weather and the season of the year, variety to counteract fatiguing monotony and relief from the feeling of being shut in.
sv: Ut- blicksfönster ger kontakt med omgivningen med syfte att ge information för orientering, upplevelse av väder och årstid, omväxling för att motverka tröttande enformighet och en minskad känsla av instängdhet.

source: This latter feeling is especially liable to occur in small rooms and rooms with low ceilings.
sv: Känslan av instängdhet kan uppstå särskilt i mindre lokaler och lokaler med liten rumshöjd.

source: The term “view windows” normally refers to windows set in the wall and affording an outdoor view
sv: Med fönster som ger utblick avses normalt placerade väggfönster mot det fria.

source: Sometimes wall windows positioned high up, or skylights, can also provide valuable contact with the outside world.
sv: Ibland kan också högt placerade väggfönster eller takfönster ge värdefull kontakt med omvärlden.

source: If a direct outside view is not possible, the possibility of looking out over a daylit room is usually appreciated.
sv: Om inte direkt utblick är möjlig upplevs det normalt som värdefullt att kunna se ut över ett dagsljusbelyst rum.

source: Daylight varies considerably according to the season of the year, the time of day and weather conditions.
sv: Dagsljuset varierar kraftigt med årstid, tid på dygnet och väderlek.

source: This can make it difficult or impossible to achieve good task lighting with daylight only.
sv: Det kan därför vara svårt eller omöjligt att enbart med dagsljus få en varaktigt god arbetsbelysning.

source: Daylight is normally supplemented by means of artificial lighting, in such a way that lighting installations are designed regardless of daylight.
sv: Normalt kompletteras dagsljus med artificiell belysning på så sätt att belysningsanläggningar dimensioneras utan hänsyn till dagsljus.

source: In the planning of lighting installations and in the subsequent assessment of lighting, the following factors may need to be taken into account, depending on the type of work involved: lighting intensity, luminance distribution, direction of the light, contrast, dazzling, colour reproduction and light colour.
sv: Vid planering av en belysningsanläggning samt vid efterföljande bedömning av belysning kan, beroende på typ av arbete, bl.a. följande faktorer behöva beaktas: belysningsstyrka, luminansfördelning, ljusets riktning, kontrast, bländning, färgåtergivning och ljusfärg.

source: The examination and assessment of lighting can involve measuring lighting intensity or luminance and also subjectively evaluating other lighting factors.
sv: Undersökning och bedömning av belysning kan avse dels mätning av belysningsstyrka eller luminans, dels subjektiv värdering av övriga belys- ningsfaktorer.

source: Obvious shortcomings such as dazzling, poor contrast, unsuitable incidence of light, disruptive shadow formation, poor colour reproduction and flicker can be established by observation, without any need for measuring instruments.
sv: Uppenbara brister såsom bländning, dålig kontrast, olämpligt ljusinfall, störande skuggbildning, dålig färgåtergivning och flimmer kan fastställas genom observation utan hjälp av mätinstrument.

source: Inadequate or excessively strong lighting, incorrect light incidence, reflections and shadows augment the risk of accidents and can, for example, give rise to eye disorders and musculoskeletal injuries.
sv: Otillräcklig eller alltför stark belysning, felaktigt ljusinfall, reflexer och skuggbilder ökar risken för olycksfall samt kan ge upphov till exempelvis ögonbesvär och belastningsskador.

source: Satisfactory light conditions are needed, not only at the workplace but also in neighbouring spaces and areas which people frequent or which they pass through in the course of the working day or at the beginning or end of work, such as staircases, passageways and roads.
sv: Tillfredsställande ljusförhållanden behövs inte enbart på arbetsplatsen utan även i angränsande utrymmen och områden där personer vistas eller förflyttar sig under arbetsdagen eller vid arbetets början eller slut, såsom exempelvis trapphus, gångar och vägar.

source: The need of lighting also of temporary workplaces for service and cleaning staff must also be taken into account.
sv: Det är viktigt att beakta belys- ningsbehovet även på tillfälliga arbetsplatser för underhålls- och städpersonal.

source: Particular accident risks may be present at outdoor workplaces and temporary worksites, e.g. construction sites, mining areas and traffic and transport routes.
sv: Risker för olycksfall kan särskilt finnas på utomhusarbetsplatser som t.ex. byggarbetsplatser, gruvområden, trafik- och transportleder, lagerplatser utomhus och skol- och förskolegårdar.

source: On construction sites, where working conditions are changing all the time, it is important that the lighting installation should be continuously overhauled and the positioning of light fittings adapted to changes in working conditions.
sv: På byggarbetsplatser, där arbetsförhållandena ständigt ändras, är det viktigt att belysningsanläggningen fortlöpande ses över och armaturernas placering anpassas till ändrade arbetsförhållanden.

source: It is appropriate for lighting to be planned and proportioned in such a way that it will remain sufficient in spite of a certain normal dirtying of the lighting installation and with allowance for the ageing of light sources.
sv: Det är lämpligt att belysningen planeras och dimensioneras så att den är tillräcklig även vid en viss normal nedsmutsning av belysningsanläggning- en och med beaktande av att ljuskällorna åldras.

source: A new lighting installation, therefore, needs to be proportioned for a greater lighting intensity than the figure which tables recommend for the task.
sv: En ny belysningsanlägg- ning behöver därför dimensioneras för högre belysningsstyrka än det värde som i tabellverk rekommenderas för arbetsuppgiften.

source: Lighting should also be planned with reference to the colour scheme of the room.
sv: Vid planering av belysningen bör hänsyn även tas till färgsättningen i rummet.

source: To reduce the cost of changing light sources, they can often be replaced a group at a time in large installations.
sv: För att minska kostnaden för att byta ljuskällor kan byten vid större anläggningar ofta utföras gruppvis.

source: This should be done and predetermined at suitably chosen times.
sv: Detta bör ske vid på förhand bestämda och lämpligt valda tidpunkter.

source: The maintenance plan should also draw attention to the importance of choosing the right colour of light when changing the light source.
sv: I underhållsplanen bör även vikten av att rätt ljusfärg väljs vid byte av ljuskälla påpekas.

source: Light sources and fittings should be cleaned regularly.
sv: Ljuskällor och armaturer bör rengöras regelbundet.

source: Regular cleaning of the workplace surfaces also has an important bearing on lighting conditions there.
sv: Även en återkommande rengöring av samtliga rumsytor är väsentlig för lokalens ljusförhållanden.

source: The light requirement is determined partly by individual visual capacity and the nature of the task, detail size and contrast and requirements of precision and speed.
sv: Ljusbehovet bestäms bl.a. av den individuella synförmågan och arbetsuppgiftens art, detaljstorlek och kontrast samt krav på precision och snabbhet.

source: Visual capacity deteriorates with advancing age: the lens of the eye slowly becomes clouded, at the same time as the vision cells degenerate.
sv: Med tilltagande ålder försämras synförmågan: ögonlinsen grumlas långsamt samtidigt som syncellerna degene- rerar.

source: Changes of this kind can start to appear already between the ages of 40 and 45.
sv: Sådana förändringar kan börja märkas redan i åldrarna 40– 45 år.

source: To meet the requirements of Section 11, the artificial lighting may need to be designed as different kinds of general lighting or as a combination of general lighting and task lighting.
sv: För att uppfylla kraven i 11 § kan den artificiella belysningen utformas som allmänbelysning av olika typer eller som allmänbelysning kombinerad med platsbelysning.

source: The purpose of general lighting is to afford sufficient illumination within both the inner field of vision (focusing on the visual object) and in the outer and peripheral field of vision.
sv: Syftet med allmänbelysningen är att ge tillräcklig belysning såväl i det inre synfältet (på synobjektet) som i det yttre och perifera synfältet.

source: For the avoidance of direct dazzling, light sources should be shaded.
sv: För att undvika direktbländning bör ljuskällorna avskärmas.

source: This localised general lighting is achieved by means of specially directed and distributed light fittings adapted to the lighting requirements of the individual workplaces in terms of the direction, intensity and distribution of lighting.
sv: Denna lokaliserade allmänbelysning åstadkoms genom speciellt riktade och fördelade armaturer som anpassas till de enskilda arbetsplatsernas ljusbehov med avseende på ljusriktning, belysningsstyrka och ljusfördelning.

source: If the installation is made in such a way that the fittings can easily be moved and can be individually turned on and off or otherwise regulated, this will enhance the possibilities of adapting lighting conditions to the work in hand.
sv: Om installationen utförs så att armaturerna går lätt att flytta samt kan tändas och släckas individuellt eller ljusregleras på annat sätt, ökar möjligheterna att anpassa belysningen till arbetet.

source: At large outdoor workplaces where the lighting takes the form of light sources on tall masts, dazzling can easily occur when work is done looking upwards in the direction of the light source, e.g. during loading and unloading.
sv: På större utomhusarbetsplatser, där belysningen anordnats genom ljuskällor monterade på höga master, uppstår lätt bländning då arbete bedrivs med uppåtriktad blick i ljuskällans riktning, t.ex. vid lastning och lossning.

source: In addition, the high light source luminances in relation to the surrounding darkness may cause contrast dazzling.
sv: Dessutom kan de höga ljuskälleluminanserna i förhållande till omgivande mörker ge kontrastbländning.
